[
    {
        "Title": "X-Men: Apocalypse",
        "Year": "2016",
        "Rated": "PG-13",
        "Released": "27 May 2016",
        "Runtime": "144 min",
        "Genre": "Action, Adventure, Sci-Fi",
        "Director": "Bryan Singer",
        "Writer": "Simon Kinberg (screenplay by), Bryan Singer (story by), Simon Kinberg (story by), Michael Dougherty (story by), Dan Harris (story by)",
        "Actors": "James McAvoy, Michael Fassbender, Jennifer Lawrence, Nicholas Hoult",
        "Plot": "Since the dawn of civilization, he was worshiped as a god. Apocalypse, the first and most powerful mutant from Marvel's X-Men universe, amassed the powers of many other mutants, becoming immortal and invincible. Upon awakening after thousands of years, he is disillusioned with the world as he finds it and recruits a team of powerful mutants, including a disheartened Magneto, to cleanse mankind and create a new world order, over which he will reign. As the fate of the Earth hangs in the balance, Raven with the help of Professor X must lead a team of young X-Men to stop their greatest nemesis and save mankind from complete destruction.",
        "Language": "English, Polish, German, Arabic, Egyptian (Ancient)",
        "Country": "USA",
        "Awards": "1 win & 19 nominations.",
        "Poster": "https://m.media-amazon.com/images/M/MV5BMjU1ODM1MzYxN15BMl5BanBnXkFtZTgwOTA4NDE2ODE@._V1_SX300.jpg",
        "Ratings": [
            {
                "Source": "Internet Movie Database",
                "Value": "6.9/10"
            },
            {
                "Source": "Rotten Tomatoes",
                "Value": "47%"
            },
            {
                "Source": "Metacritic",
                "Value": "52/100"
            }
        ],
        "Metascore": "52",
        "imdbRating": "6.9",
        "imdbVotes": "382,834",
        "imdbID": "tt3385516",
        "Type": "movie",
        "DVD": "04 Oct 2016",
        "BoxOffice": "$135,729,385",
        "Production": "20th Century Fox",
        "Website": "N/A",
        "Response": "True",
        "Watched": false,
        "Comments": []
    },
    {
        "Title": "Apocalypse Now",
        "Year": "1979",
        "Rated": "R",
        "Released": "15 Aug 1979",
        "Runtime": "147 min",
        "Genre": "Drama, Mystery, War",
        "Director": "Francis Ford Coppola",
        "Writer": "John Milius, Francis Ford Coppola, Michael Herr (narration)",
        "Actors": "Marlon Brando, Martin Sheen, Robert Duvall, Frederic Forrest",
        "Plot": "It is the height of the war in Vietnam, and U.S. Army Captain Willard is sent by Colonel Lucas and a General to carry out a mission that, officially, 'does not exist - nor will it ever exist'. The mission: To seek out a mysterious Green Beret Colonel, Walter Kurtz, whose army has crossed the border into Cambodia and is conducting hit-and-run missions against the Viet Cong and NVA. The army believes Kurtz has gone completely insane and Willard's job is to eliminate him! Willard, sent up the Nung River on a U.S. Navy patrol boat, discovers that his target is one of the most decorated officers in the U.S. Army. His crew meets up with surfer-type Lt-Colonel Kilgore, head of a U.S Army helicopter cavalry group which eliminates a Viet Cong outpost to provide an entry point into the Nung River. After some hair-raising encounters, in which some of his crew are killed, Willard, Lance and Chef reach Colonel Kurtz's outpost, beyond the Do Lung Bridge. Now, after becoming prisoners of Kurtz, will Willard & the others be able to fulfill their mission?",
        "Language": "English, French, Vietnamese",
        "Country": "USA",
        "Awards": "Won 2 Oscars. Another 18 wins & 32 nominations.",
        "Poster": "https://m.media-amazon.com/images/M/MV5BMDdhODg0MjYtYzBiOS00ZmI5LWEwZGYtZDEyNDU4MmQyNzFkXkEyXkFqcGdeQXVyNzkwMjQ5NzM@._V1_SX300.jpg",
        "Ratings": [
            {
                "Source": "Internet Movie Database",
                "Value": "8.4/10"
            },
            {
                "Source": "Rotten Tomatoes",
                "Value": "98%"
            },
            {
                "Source": "Metacritic",
                "Value": "94/100"
            }
        ],
        "Metascore": "94",
        "imdbRating": "8.4",
        "imdbVotes": "588,630",
        "imdbID": "tt0078788",
        "Type": "movie",
        "DVD": "20 Nov 2001",
        "BoxOffice": "N/A",
        "Production": "United Artists",
        "Website": "N/A",
        "Response": "True",
        "Watched": false,
        "Comments": []
    },
    {
        "Title": "Resident Evil: Apocalypse",
        "Year": "2004",
        "Rated": "R",
        "Released": "10 Sep 2004",
        "Runtime": "94 min",
        "Genre": "Action, Horror, Sci-Fi, Thriller",
        "Director": "Alexander Witt",
        "Writer": "Paul W.S. Anderson",
        "Actors": "Milla Jovovich, Sienna Guillory, Oded Fehr, Thomas Kretschmann",
        "Plot": "Alice awakens from a terrible sleep to find her worst fears realized--the bloodthirsty Undead, which she and the now-annihilated squad of elite military fought to destroy, have been unleashed on the city that surrounds the secret facility of the Umbrella Corporation. Discovering she was an Umbrella experiment, Alice has been bio-genetically enhanced with new strengths, senses and dexterity--and she will need them. In the heart of the ravaged Raccoon City, a small group of uninfected people, including Jill Valentine, a recently demoted member of Umbrella Corp's elite Special Tactics and Rescue Services team, and S.T.A.R.S team leader Carlos Oliveira, fight for their lives against swarms of Undead and the deadlier and faster Lickers. Running out of luck and resources, the group is rescued by Alice, and they begin to wage an exhilarating battle to survive and escape before the Umbrella Corporation erases its experiment from the face of the earth. Their only hope lies somewhere within Raccoon City--Dr Charles Ashford, one of the leading scientists for the Umbrella Corporation, will help Alice and the others escape the city safely--if they find his daughter. Angie Ashford became separated from her father and now hides in fear. Alice, Jill and Carlos will have to fight their way through an army of Undead to save her. All the while, a secret weapon code-named Nemesis has been experimentally altered with greater modifications than Alice and has been programmed to track and destroy them. They will need all their strengths and skills to fight the battle of their lives against the mindless evil that has infected the city and the powerful forces that unleashed it on mankind.",
        "Language": "English",
        "Country": "Germany, France, UK, Canada, USA",
        "Awards": "6 wins & 3 nominations.",
        "Poster": "https://m.media-amazon.com/images/M/MV5BMTc1NTUxMzk0Nl5BMl5BanBnXkFtZTcwNDQ1MDIzMw@@._V1_SX300.jpg",
        "Ratings": [
            {
                "Source": "Internet Movie Database",
                "Value": "6.2/10"
            },
            {
                "Source": "Rotten Tomatoes",
                "Value": "20%"
            },
            {
                "Source": "Metacritic",
                "Value": "35/100"
            }
        ],
        "Metascore": "35",
        "imdbRating": "6.2",
        "imdbVotes": "182,832",
        "imdbID": "tt0318627",
        "Type": "movie",
        "DVD": "04 Sep 2007",
        "BoxOffice": "$50,600,000",
        "Production": "Sony Pictures",
        "Website": "N/A",
        "Response": "True",
        "Watched": false,
        "Comments": []
    },
    {
        "Title": "Scouts Guide to the Zombie Apocalypse",
        "Year": "2015",
        "Rated": "R",
        "Released": "30 Oct 2015",
        "Runtime": "93 min",
        "Genre": "Action, Comedy, Horror",
        "Director": "Christopher Landon",
        "Writer": "Carrie Lee Wilson (screenplay), Emi Mochizuki (screenplay), Christopher Landon (screenplay), Lona Williams (story), Carrie Lee Wilson (story), Emi Mochizuki (story)",
        "Actors": "Tye Sheridan, Logan Miller, Joey Morgan, Sarah Dumont",
        "Plot": "A reckless janitor accidentally releases a zombie from a laboratory of research. Meanwhile, the teenagers scouts Ben Goudy and Carter Grant decide to camp for the last time since they are too old to be scouts. The problem is that they do not want to harm the feelings of their friend Augie Foster and the Scout Leader Rogers. They have a flat tire after hitting a deer on the road and Carter's sister Kendall Grant, her boyfriend and her friend Chloe stop their Jeep to see whether they need a ride. They invite Ben and Carter to go to a party in the night. The two scouts leave the camping during the night to go to the party. When they drive through the town, they do not see a living soul and they decide to visit a night-club since the bouncer is not at the door. They discover that people have turned into zombies and they team-up with Ben's recent acquaintance Denise Russo, who is bartender in the nightclub, and Augie that was left alone at the camp and came to the town. Soon they discover that the non-infected inhabitants have been evacuated and the town will be bombed by the government. They decide to rescue Kendall but they find that the address her boyfriend gave to them is wrong. What can they do to save Kendall?",
        "Language": "English",
        "Country": "USA",
        "Awards": "5 nominations.",
        "Poster": "https://m.media-amazon.com/images/M/MV5BMTY4NjczNjE4OV5BMl5BanBnXkFtZTgwODk0MjQ5NjE@._V1_SX300.jpg",
        "Ratings": [
            {
                "Source": "Internet Movie Database",
                "Value": "6.3/10"
            },
            {
                "Source": "Rotten Tomatoes",
                "Value": "44%"
            },
            {
                "Source": "Metacritic",
                "Value": "32/100"
            }
        ],
        "Metascore": "32",
        "imdbRating": "6.3",
        "imdbVotes": "43,713",
        "imdbID": "tt1727776",
        "Type": "movie",
        "DVD": "05 Jan 2016",
        "BoxOffice": "$3,931,256",
        "Production": "Broken Road Productions",
        "Website": "N/A",
        "Response": "True",
        "Watched": false,
        "Comments": []
    },
    {
        "Title": "Superman/Batman: Apocalypse",
        "Year": "2010",
        "Rated": "PG-13",
        "Released": "28 Sep 2010",
        "Runtime": "78 min",
        "Genre": "Animation, Action, Adventure, Sci-Fi",
        "Director": "Lauren Montgomery",
        "Writer": "Bob Kane (character created by: Batman), Jerry Siegel (character created by: Superman), Joe Shuster (character created by: Superman), William Moulton Marston (character created by: Wonder Woman), Jack Kirby (characters created by: Darkseid & The New Gods), Jeph Loeb (graphic novel), Michael Turner (graphic novel), Tab Murphy",
        "Actors": "Andre Braugher, Kevin Conroy, Tim Daly, Susan Eisenberg",
        "Plot": "Batman discovers a mysterious teen-aged girl with super-human powers and a connection to Superman. When the girl comes to the attention of Darkseid, the evil overlord of Apokolips, events take a decidedly dangerous turn.",
        "Language": "English, French, Esperanto",
        "Country": "USA",
        "Awards": "N/A",
        "Poster": "https://m.media-amazon.com/images/M/MV5BMjk3ODhmNjgtZjllOC00ZWZjLTkwYzQtNzc1Y2ZhMjY2ODE0XkEyXkFqcGdeQXVyNTAyODkwOQ@@._V1_SX300.jpg",
        "Ratings": [
            {
                "Source": "Internet Movie Database",
                "Value": "7.1/10"
            }
        ],
        "Metascore": "N/A",
        "imdbRating": "7.1",
        "imdbVotes": "23,793",
        "imdbID": "tt1673430",
        "Type": "movie",
        "DVD": "28 Sep 2010",
        "BoxOffice": "N/A",
        "Production": "WARNER BROTHERS PICTURES",
        "Website": "N/A",
        "Response": "True",
        "Watched": false,
        "Comments": []
    },
    {
        "Title": "Crimson Rivers 2: Angels of the Apocalypse",
        "Year": "2004",
        "Rated": "R",
        "Released": "18 Feb 2004",
        "Runtime": "97 min",
        "Genre": "Action, Crime, Horror, Mystery, Thriller",
        "Director": "Olivier Dahan",
        "Writer": "Luc Besson, Jean-Christophe Grangé (characters)",
        "Actors": "Jean Reno, Benoît Magimel, Christopher Lee, Camille Natta",
        "Plot": "Chief Niemans is investigating a series of ritual murders: The victims are crucified. He teams up with young officer Reda, who gets embroiled after a man dressed as a monk tries to kill a confused guy Reda picked up on the street. Together with a specialist on christian mythology they uncover a mysterious group called \"Angels of the Apokalypse\".",
        "Language": "French, German, Italian",
        "Country": "France, Italy, UK",
        "Awards": "N/A",
        "Poster": "https://m.media-amazon.com/images/M/MV5BNzc5OTA4NDgtMjAzZi00MjFhLTk4OWQtNDRkNmNjZDNlN2FjXkEyXkFqcGdeQXVyNDk3NzU2MTQ@._V1_SX300.jpg",
        "Ratings": [
            {
                "Source": "Internet Movie Database",
                "Value": "6.0/10"
            }
        ],
        "Metascore": "N/A",
        "imdbRating": "6.0",
        "imdbVotes": "19,243",
        "imdbID": "tt0337103",
        "Type": "movie",
        "DVD": "29 Mar 2005",
        "BoxOffice": "N/A",
        "Production": "Studio Canal [fr]",
        "Website": "N/A",
        "Response": "True",
        "Watched": false,
        "Comments": []
    },
    {
        "Title": "Hearts of Darkness: A Filmmaker's Apocalypse",
        "Year": "1991",
        "Rated": "R",
        "Released": "06 Dec 1991",
        "Runtime": "96 min",
        "Genre": "Documentary",
        "Director": "Fax Bahr, George Hickenlooper, Eleanor Coppola",
        "Writer": "Fax Bahr, George Hickenlooper",
        "Actors": "Francis Ford Coppola, Eleanor Coppola, Orson Welles, John Milius",
        "Plot": "Documents the sensational events surrounding the making of Apocalypse Now (1979)' and Francis Ford Coppola's struggle with nature, governments, actors, and self-doubt. Includes footage and sound secretly recorded by Eleanor Coppola, wife of Francis.",
        "Language": "English",
        "Country": "USA",
        "Awards": "Won 2 Primetime Emmys. Another 6 wins & 5 nominations.",
        "Poster": "https://m.media-amazon.com/images/M/MV5BNWQxZTQ4OTItNTdmNS00NGY0LTg5NDAtZjViMjQ2ODg3ZGFhXkEyXkFqcGdeQXVyMTQxNzMzNDI@._V1_SX300.jpg",
        "Ratings": [
            {
                "Source": "Internet Movie Database",
                "Value": "8.1/10"
            },
            {
                "Source": "Rotten Tomatoes",
                "Value": "100%"
            }
        ],
        "Metascore": "N/A",
        "imdbRating": "8.1",
        "imdbVotes": "18,134",
        "imdbID": "tt0102015",
        "Type": "movie",
        "DVD": "20 Nov 2007",
        "BoxOffice": "N/A",
        "Production": "Showtime Network",
        "Website": "N/A",
        "Response": "True",
        "Watched": false,
        "Comments": []
    }
]
